```
  # aws_cloudwatch_event_rule.throttled_queue_watcher must be replaced
-/+ resource "aws_cloudwatch_event_rule" "throttled_queue_watcher" {
      ~ arn                 = "arn:aws:events:us-east-1:596205514787:rule/terraform-20230513001007253500000007" -> (known after apply)
        event_bus_name      = "default"
      ~ id                  = "terraform-20230513001007253500000007" -> (known after apply)
        is_enabled          = true
      ~ name                = "terraform-20230513001007253500000007" -> "squinlan-throttled_queue_watcher" # forces replacement
      ~ name_prefix         = "terraform-" -> (known after apply)
        schedule_expression = "rate(1 minute)"
      - tags                = {} -> null
      ~ tags_all            = {} -> (known after apply)
    }

  # aws_cloudwatch_event_target.throttled_queue_watcher must be replaced
-/+ resource "aws_cloudwatch_event_target" "throttled_queue_watcher" {
        arn            = "arn:aws:lambda:us-east-1:596205514787:function:squinlan-sqs2sfThrottle"
        event_bus_name = "default"
      ~ id             = "terraform-20230513001007253500000007-terraform-20230513004706613000000020" -> (known after apply)
        input          = jsonencode(
            {
                messageLimit = 500
                queueUrl     = "https://sqs.us-east-1.amazonaws.com/596205514787/squinlan-ThrottledQueue"
                timeLimit    = 60
            }
        )
      ~ rule           = "terraform-20230513001007253500000007" -> "squinlan-throttled_queue_watcher" # forces replacement
      ~ target_id      = "terraform-20230513004706613000000020" -> (known after apply)
    }
```

@botanical  You were saying that replacement is bad? Does that mean we can't land this?